# Все комманды 

# Комманда номер 1) - Создание venv в терминале:
#python3 -m venv venv(здесь пишеться имя каталога)

# Комманда номер 2) - Активация:
#source venv/bin/activate

# Комманда номер 3) Показ всех пакетов и их обновления:
#Команда pip freeze в Python используется для вывода списка всех установленных
#в текущем виртуальном окружении пакетов вместе с их версиями
# Комманда:     pip freeze



# Комманда номер 4) Обновления библеотек до новой версии:
#pip install -U pip setuptools(Здесь пишеться именна библеотек)

# Комманда номер 5) Установка библетек для Парсинга:
# pip install requests lxml


# Комманда номер 6) Удаление библеотеки:
#pip uninstall lxml(Имя библеотеки) -y

# Комманда номер 7) Деактивация Виртуального окружения:
# deactivate

# Комманда 8)  pip install -r requirments.txt:
#Файл requirements.txt обычно содержит список пакетов
#и их версий, необходимых для проекта.
# pip install -r requirements.txt

#pip freeze > requirements.txt - Если уже библеотеки были созданы то можно записать в requiments.txt


# Комманда номер 9) Для установления всех библеотек для Парсинга:
# pip install beautifulsoup4 lxml pandas pyyaml scrapy
