"=======================Логические операторы========================"
# Логические операторы - выражения, которые возварщают True,
#  если выражение верное, False если выражение не верное 
#   and - и
#   or  - или
#   not - не

"========РАВЕНСТВО============"
5 == 5  #Это оператор Сравнение в данном выражение вернеться True
#name = 5 - Это оператор присваивание 
2 == 5 #False

"=======================    Не равенство        ======================="

4 != 5 #True 
5 != 5 #false


"=============          Знак Больше     ======================"
4 > 4 #False
10 > 5 #True


"=======================МЕНЬШЕ==============================="
1 < 4 #True
10 < 5 #False



"=============================Больше или равно ====================="
10 >= 4 #True
4 >= 4 #True
1 > 10 #False

"================Меньше или равно================"
10 <= 20 #True
10 <= 10 #True
20 <= 10 #False


print('5' == 5)

print("hello" == 'hello')



"==========================     (and, or, not)      ========================="
#   and - и, Возвращает True Если оба условя верны, False если хоть одно из них неверное
#   or  - или, Вернет true Если один хоть одно условие True, Вернет False если оба усвовие неверны
#   not - не, 

a = 5
b =3
print(a == b and a > b) #False
print(a == b or a > b)  # True


print(not True)
#False
print(not False)
#True

print(not a == 5)




"===================    <Bolean type> ================== "
print(bool(0))
print(bool(1))
print(bool(-123))
print(bool('hello'))



"=============      is      ================="

a = 1
b = 1
print(a == b)
print(a is b)

"==================     <None Type>     ====================="
#None  - неизменяемый тип данных с одним значением None, который
#Исполльзуеться для обозначения отсутствия значения 

print(bool(None))      #false
print(bool('None'))    #True



